feat: it's writing itself <3
